app/controllers/categories_controller.rb

	def create
		@category=Category.new(params[:category])
		if @category.save
---
INSERT INTO `categories` (`name`, `created_at`, `updated_at`, `sl_no`) VALUES('furniture', '2011-09-30 07:16:47', '2011-09-30 07:16:47', 100)

	def delete
		@category=Category.find(params[:id])
		if @category.destroy
---
SELECT * FROM `categories` WHERE (`categories`.`id` = 1)
DELETE FROM `categories` WHERE `id` = 1

	def update
		@category=Category.find(params[:id])
		if @category.update_attributes(params[:category])
---
SELECT * FROM `categories` WHERE (`categories`.`id` = 1)
UPDATE `categories` SET `updated_at` = '2011-09-30 11:23:34', `name` = 'c6' WHERE `id` = 1