app/controllers/products_controller.rb

INSERT INTO `products` (`name`, `price`, `created_at`, `updated_at`, `category_id`, `status`) VALUES('p1', 1232, '2011-09-30 07:40:43', '2011-09-30 07:40:43', 1, 1)
---
	def create
		@product=Product.new(params[:product])
		puts @product
		if @product.save

SELECT * FROM `products` WHERE (`products`.`status` = '1')
---
	def list
		@products=Product.find(:all, :conditions=>{:status=>"1"})

SELECT * FROM `products` WHERE (`products`.`status` = '0')
---
	def list1
		@products=Product.find(:all, :conditions=>{:status=>"0"})

SELECT * FROM `products` WHERE (`products`.`id` = 24)
UPDATE `products` SET `updated_at` = '2011-09-30 12:21:51', `price` = 5555 WHERE `id` = 24
---
 	def update
		@product=Product.find(params[:id])
		if @product.update_attributes(params[:product])

SELECT * FROM `products` WHERE (`products`.`id` = '--- :id\n')
DELETE FROM `products` WHERE `id` = 1
---
	def delete
		@product=Product.find(params[:id])
		if @product.destroy